/* SPDX-License-Identifier: AGPL-3.0-only */
/* SPDX-FileCopyrightText: 2025-2026 Yurii Arkhanhelskyi */
/* Описания доступа, которые ПОКАЗЫВАЕТ СИСТЕМА.
   Не переводы интерфейса: эти строки читает macOS в своём окне запроса,
   и язык там — системный, а не выбранный в настройках приложения.
   Правится вместе с macos/Runner/Info.plist: ключ, которого нет здесь,
   система покажет на языке разработки. */

"NSMicrophoneUsageDescription" = "O Secretly utiliza o microfone para chamadas de voz e vídeo e para gravar mensagens de voz.";
"NSCameraUsageDescription" = "O Secretly utiliza a câmara para videochamadas e para ler códigos QR de associação de dispositivos.";
"NSPhotoLibraryUsageDescription" = "O Secretly acede às suas fotografias para enviar imagens nas conversas.";
"NSDocumentsFolderUsageDescription" = "O Secretly acede à pasta Documentos para enviar ficheiros nas conversas.";
"NSDownloadsFolderUsageDescription" = "O Secretly acede à pasta Transferências para guardar ficheiros das conversas.";
"NSDesktopFolderUsageDescription" = "O Secretly acede ao Ambiente de Trabalho para enviar ficheiros e capturas de ecrã.";
"NSAppleEventsUsageDescription" = "O Secretly utiliza os Apple Events para integração com as notificações do sistema.";
